#pragma once

/**
 * Name: Agartha
 * Version: 1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function GA_Block.GA_Block_C.OnChange_D933C1944C4C0D0F91FD00BDC11C2F22
	 */
	struct UGA_Block_C_OnChange_D933C1944C4C0D0F91FD00BDC11C2F22_Params
	{
	public:
		bool                                                       bMatchesComparison;                                      // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_DT23[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      CurrentValue;                                            // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function GA_Block.GA_Block_C.EventReceived_2C33CBF247F3F1EBE919938F89995296
	 */
	struct UGA_Block_C_EventReceived_2C33CBF247F3F1EBE919938F89995296_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_Block.GA_Block_C.EventReceived_A66AD4AB411CD3849F56D2BBEF9499E4
	 */
	struct UGA_Block_C_EventReceived_A66AD4AB411CD3849F56D2BBEF9499E4_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_Block.GA_Block_C.OnRelease_D40188364B739515CD31D0B253664B7A
	 */
	struct UGA_Block_C_OnRelease_D40188364B739515CD31D0B253664B7A_Params
	{
	public:
		float                                                      TimeHeld;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function GA_Block.GA_Block_C.EventReceived_6C3BA1FE422D9CA292132AB543A2FBFE
	 */
	struct UGA_Block_C_EventReceived_6C3BA1FE422D9CA292132AB543A2FBFE_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_Block.GA_Block_C.OnRelease_F452A7214450E0FE3DDBECA7206259C8
	 */
	struct UGA_Block_C_OnRelease_F452A7214450E0FE3DDBECA7206259C8_Params
	{
	public:
		float                                                      TimeHeld;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function GA_Block.GA_Block_C.K2_OnEndAbility
	 */
	struct UGA_Block_C_K2_OnEndAbility_Params
	{
	public:
		bool                                                       bWasCancelled;                                           // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Block.GA_Block_C.K2_ActivateAbility
	 */
	struct UGA_Block_C_K2_ActivateAbility_Params
	{	};

	/**
	 * Function GA_Block.GA_Block_C.ExecuteUbergraph_GA_Block
	 */
	struct UGA_Block_C_ExecuteUbergraph_GA_Block_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_QXP3[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
