#pragma once

/**
 * Name: Agartha
 * Version: 1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function GA_Gada_Overhead.GA_Gada_Overhead_C.OnCancelled_5FF0F6294B8CDB78710E969CC93FA7C4
	 */
	struct UGA_Gada_Overhead_C_OnCancelled_5FF0F6294B8CDB78710E969CC93FA7C4_Params
	{	};

	/**
	 * Function GA_Gada_Overhead.GA_Gada_Overhead_C.OnInterrupted_5FF0F6294B8CDB78710E969CC93FA7C4
	 */
	struct UGA_Gada_Overhead_C_OnInterrupted_5FF0F6294B8CDB78710E969CC93FA7C4_Params
	{	};

	/**
	 * Function GA_Gada_Overhead.GA_Gada_Overhead_C.OnBlendOut_5FF0F6294B8CDB78710E969CC93FA7C4
	 */
	struct UGA_Gada_Overhead_C_OnBlendOut_5FF0F6294B8CDB78710E969CC93FA7C4_Params
	{	};

	/**
	 * Function GA_Gada_Overhead.GA_Gada_Overhead_C.OnCompleted_5FF0F6294B8CDB78710E969CC93FA7C4
	 */
	struct UGA_Gada_Overhead_C_OnCompleted_5FF0F6294B8CDB78710E969CC93FA7C4_Params
	{	};

	/**
	 * Function GA_Gada_Overhead.GA_Gada_Overhead_C.OnCancelled_6E37375E47F54634250095BBE31827E8
	 */
	struct UGA_Gada_Overhead_C_OnCancelled_6E37375E47F54634250095BBE31827E8_Params
	{	};

	/**
	 * Function GA_Gada_Overhead.GA_Gada_Overhead_C.OnInterrupted_6E37375E47F54634250095BBE31827E8
	 */
	struct UGA_Gada_Overhead_C_OnInterrupted_6E37375E47F54634250095BBE31827E8_Params
	{	};

	/**
	 * Function GA_Gada_Overhead.GA_Gada_Overhead_C.OnBlendOut_6E37375E47F54634250095BBE31827E8
	 */
	struct UGA_Gada_Overhead_C_OnBlendOut_6E37375E47F54634250095BBE31827E8_Params
	{	};

	/**
	 * Function GA_Gada_Overhead.GA_Gada_Overhead_C.OnCompleted_6E37375E47F54634250095BBE31827E8
	 */
	struct UGA_Gada_Overhead_C_OnCompleted_6E37375E47F54634250095BBE31827E8_Params
	{	};

	/**
	 * Function GA_Gada_Overhead.GA_Gada_Overhead_C.EventReceived_CA198FD94DC9BD5035AF428DFC4C9D55
	 */
	struct UGA_Gada_Overhead_C_EventReceived_CA198FD94DC9BD5035AF428DFC4C9D55_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_Gada_Overhead.GA_Gada_Overhead_C.EventReceived_0911B90D410B67ACC0287BA4B6B75511
	 */
	struct UGA_Gada_Overhead_C_EventReceived_0911B90D410B67ACC0287BA4B6B75511_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_Gada_Overhead.GA_Gada_Overhead_C.OnCancelled_F01DD1CB4919A14964D61CAF2574E11B
	 */
	struct UGA_Gada_Overhead_C_OnCancelled_F01DD1CB4919A14964D61CAF2574E11B_Params
	{	};

	/**
	 * Function GA_Gada_Overhead.GA_Gada_Overhead_C.OnInterrupted_F01DD1CB4919A14964D61CAF2574E11B
	 */
	struct UGA_Gada_Overhead_C_OnInterrupted_F01DD1CB4919A14964D61CAF2574E11B_Params
	{	};

	/**
	 * Function GA_Gada_Overhead.GA_Gada_Overhead_C.OnBlendOut_F01DD1CB4919A14964D61CAF2574E11B
	 */
	struct UGA_Gada_Overhead_C_OnBlendOut_F01DD1CB4919A14964D61CAF2574E11B_Params
	{	};

	/**
	 * Function GA_Gada_Overhead.GA_Gada_Overhead_C.OnCompleted_F01DD1CB4919A14964D61CAF2574E11B
	 */
	struct UGA_Gada_Overhead_C_OnCompleted_F01DD1CB4919A14964D61CAF2574E11B_Params
	{	};

	/**
	 * Function GA_Gada_Overhead.GA_Gada_Overhead_C.EventReceived_18B6340F41FB99497315BDB30FCFB7FE
	 */
	struct UGA_Gada_Overhead_C_EventReceived_18B6340F41FB99497315BDB30FCFB7FE_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_Gada_Overhead.GA_Gada_Overhead_C.K2_ActivateAbility
	 */
	struct UGA_Gada_Overhead_C_K2_ActivateAbility_Params
	{	};

	/**
	 * Function GA_Gada_Overhead.GA_Gada_Overhead_C.K2_OnEndAbility
	 */
	struct UGA_Gada_Overhead_C_K2_OnEndAbility_Params
	{
	public:
		bool                                                       bWasCancelled;                                           // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Gada_Overhead.GA_Gada_Overhead_C.Add Knockback
	 */
	struct UGA_Gada_Overhead_C_Add_Knockback_Params
	{
	public:
		float                                                      Radius;                                                  // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function GA_Gada_Overhead.GA_Gada_Overhead_C.ExecuteUbergraph_GA_Gada_Overhead
	 */
	struct UGA_Gada_Overhead_C_ExecuteUbergraph_GA_Gada_Overhead_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
