#pragma once

/**
 * Name: Agartha
 * Version: 1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.OnCancelled_8FA473A1490CED469FE3FB800F4EF5DF
	 */
	struct UGA_GeneralAttack_C_OnCancelled_8FA473A1490CED469FE3FB800F4EF5DF_Params
	{	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.OnInterrupted_8FA473A1490CED469FE3FB800F4EF5DF
	 */
	struct UGA_GeneralAttack_C_OnInterrupted_8FA473A1490CED469FE3FB800F4EF5DF_Params
	{	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.OnBlendOut_8FA473A1490CED469FE3FB800F4EF5DF
	 */
	struct UGA_GeneralAttack_C_OnBlendOut_8FA473A1490CED469FE3FB800F4EF5DF_Params
	{	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.OnCompleted_8FA473A1490CED469FE3FB800F4EF5DF
	 */
	struct UGA_GeneralAttack_C_OnCompleted_8FA473A1490CED469FE3FB800F4EF5DF_Params
	{	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.EventReceived_F030D83945408555F140FAAB1B0F4077
	 */
	struct UGA_GeneralAttack_C_EventReceived_F030D83945408555F140FAAB1B0F4077_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.EventReceived_4FD158B64BB9671B0D63B0A51637BBB6
	 */
	struct UGA_GeneralAttack_C_EventReceived_4FD158B64BB9671B0D63B0A51637BBB6_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.OnPress_234FAFD64D30BFDAACB9A39F59956217
	 */
	struct UGA_GeneralAttack_C_OnPress_234FAFD64D30BFDAACB9A39F59956217_Params
	{
	public:
		float                                                      TimeWaited;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.OnRelease_7FF26A904C1E61D77E0FCCAD5D30C157
	 */
	struct UGA_GeneralAttack_C_OnRelease_7FF26A904C1E61D77E0FCCAD5D30C157_Params
	{
	public:
		float                                                      TimeHeld;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.OnCancelled_1C22BC484305A049B89318A252A5CD3C
	 */
	struct UGA_GeneralAttack_C_OnCancelled_1C22BC484305A049B89318A252A5CD3C_Params
	{	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.OnInterrupted_1C22BC484305A049B89318A252A5CD3C
	 */
	struct UGA_GeneralAttack_C_OnInterrupted_1C22BC484305A049B89318A252A5CD3C_Params
	{	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.OnBlendOut_1C22BC484305A049B89318A252A5CD3C
	 */
	struct UGA_GeneralAttack_C_OnBlendOut_1C22BC484305A049B89318A252A5CD3C_Params
	{	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.OnCompleted_1C22BC484305A049B89318A252A5CD3C
	 */
	struct UGA_GeneralAttack_C_OnCompleted_1C22BC484305A049B89318A252A5CD3C_Params
	{	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.OnCancelled_8762B4D84AF6B00C94B6878FD9193F16
	 */
	struct UGA_GeneralAttack_C_OnCancelled_8762B4D84AF6B00C94B6878FD9193F16_Params
	{	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.OnInterrupted_8762B4D84AF6B00C94B6878FD9193F16
	 */
	struct UGA_GeneralAttack_C_OnInterrupted_8762B4D84AF6B00C94B6878FD9193F16_Params
	{	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.OnBlendOut_8762B4D84AF6B00C94B6878FD9193F16
	 */
	struct UGA_GeneralAttack_C_OnBlendOut_8762B4D84AF6B00C94B6878FD9193F16_Params
	{	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.OnCompleted_8762B4D84AF6B00C94B6878FD9193F16
	 */
	struct UGA_GeneralAttack_C_OnCompleted_8762B4D84AF6B00C94B6878FD9193F16_Params
	{	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.EventReceived_531D384540E9F4A9BF7991A29BE940C4
	 */
	struct UGA_GeneralAttack_C_EventReceived_531D384540E9F4A9BF7991A29BE940C4_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.EventReceived_DB5E5ACB46ADAA7832A0A3A6523B41A0
	 */
	struct UGA_GeneralAttack_C_EventReceived_DB5E5ACB46ADAA7832A0A3A6523B41A0_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.EventReceived_681186514339C9A51176828C531DDF30
	 */
	struct UGA_GeneralAttack_C_EventReceived_681186514339C9A51176828C531DDF30_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.EventReceived_7A0EF9254CFB28696AB40F8812C8D4B1
	 */
	struct UGA_GeneralAttack_C_EventReceived_7A0EF9254CFB28696AB40F8812C8D4B1_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.EventReceived_E7D3235D466711D53A26AAB2D3D23862
	 */
	struct UGA_GeneralAttack_C_EventReceived_E7D3235D466711D53A26AAB2D3D23862_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.OnCancelled_6EF3D80A47F4A8829194C6AD538EA1CD
	 */
	struct UGA_GeneralAttack_C_OnCancelled_6EF3D80A47F4A8829194C6AD538EA1CD_Params
	{	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.OnInterrupted_6EF3D80A47F4A8829194C6AD538EA1CD
	 */
	struct UGA_GeneralAttack_C_OnInterrupted_6EF3D80A47F4A8829194C6AD538EA1CD_Params
	{	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.OnBlendOut_6EF3D80A47F4A8829194C6AD538EA1CD
	 */
	struct UGA_GeneralAttack_C_OnBlendOut_6EF3D80A47F4A8829194C6AD538EA1CD_Params
	{	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.OnCompleted_6EF3D80A47F4A8829194C6AD538EA1CD
	 */
	struct UGA_GeneralAttack_C_OnCompleted_6EF3D80A47F4A8829194C6AD538EA1CD_Params
	{	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.EventReceived_FF9D13B343C8E251E5AD4AB4326F3B5D
	 */
	struct UGA_GeneralAttack_C_EventReceived_FF9D13B343C8E251E5AD4AB4326F3B5D_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.OnFinish_68807AD74442D08350F34A9A1903EF3F
	 */
	struct UGA_GeneralAttack_C_OnFinish_68807AD74442D08350F34A9A1903EF3F_Params
	{	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.OnFinish_07890DB84E23E51936B0FFA93EC8567B
	 */
	struct UGA_GeneralAttack_C_OnFinish_07890DB84E23E51936B0FFA93EC8567B_Params
	{	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.OnFinish_B455DF75483D5CD82FC45CA8C93E81F1
	 */
	struct UGA_GeneralAttack_C_OnFinish_B455DF75483D5CD82FC45CA8C93E81F1_Params
	{	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.EventReceived_5C12FC484D5A896981A7C39873CEBCF5
	 */
	struct UGA_GeneralAttack_C_EventReceived_5C12FC484D5A896981A7C39873CEBCF5_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.EventReceived_D22F24A54F9F2EEECE0A74ACB169EE65
	 */
	struct UGA_GeneralAttack_C_EventReceived_D22F24A54F9F2EEECE0A74ACB169EE65_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.EventReceived_0B3CFAD0422A05FB0DD6519E5369C551
	 */
	struct UGA_GeneralAttack_C_EventReceived_0B3CFAD0422A05FB0DD6519E5369C551_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.K2_ActivateAbility
	 */
	struct UGA_GeneralAttack_C_K2_ActivateAbility_Params
	{	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.Next Attack
	 */
	struct UGA_GeneralAttack_C_Next_Attack_Params
	{	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.K2_OnEndAbility
	 */
	struct UGA_GeneralAttack_C_K2_OnEndAbility_Params
	{
	public:
		bool                                                       bWasCancelled;                                           // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.Release Heavy
	 */
	struct UGA_GeneralAttack_C_Release_Heavy_Params
	{	};

	/**
	 * Function GA_GeneralAttack.GA_GeneralAttack_C.ExecuteUbergraph_GA_GeneralAttack
	 */
	struct UGA_GeneralAttack_C_ExecuteUbergraph_GA_GeneralAttack_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
