#pragma once

/**
 * Name: Agartha
 * Version: 1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.K2_CanActivateAbility
	 */
	struct UGA_SheatheUnsheathe_C_K2_CanActivateAbility_Params
	{
	public:
		struct FGameplayAbilityActorInfo                           ActorInfo;                                               // 0x0000(0x0048)  (BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
		struct FGameplayTagContainer                               RelevantTags;                                            // 0x0048(0x0020)  (Parm, OutParm)
		bool                                                       ReturnValue;                                             // 0x0068(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.OnCancelled_F18A5AB54C944BD8EABE3DB3424614CE
	 */
	struct UGA_SheatheUnsheathe_C_OnCancelled_F18A5AB54C944BD8EABE3DB3424614CE_Params
	{	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.OnInterrupted_F18A5AB54C944BD8EABE3DB3424614CE
	 */
	struct UGA_SheatheUnsheathe_C_OnInterrupted_F18A5AB54C944BD8EABE3DB3424614CE_Params
	{	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.OnBlendOut_F18A5AB54C944BD8EABE3DB3424614CE
	 */
	struct UGA_SheatheUnsheathe_C_OnBlendOut_F18A5AB54C944BD8EABE3DB3424614CE_Params
	{	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.OnCompleted_F18A5AB54C944BD8EABE3DB3424614CE
	 */
	struct UGA_SheatheUnsheathe_C_OnCompleted_F18A5AB54C944BD8EABE3DB3424614CE_Params
	{	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.OnCancelled_D9A64E7041F226349F9D68B3ADAEE06F
	 */
	struct UGA_SheatheUnsheathe_C_OnCancelled_D9A64E7041F226349F9D68B3ADAEE06F_Params
	{	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.OnInterrupted_D9A64E7041F226349F9D68B3ADAEE06F
	 */
	struct UGA_SheatheUnsheathe_C_OnInterrupted_D9A64E7041F226349F9D68B3ADAEE06F_Params
	{	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.OnBlendOut_D9A64E7041F226349F9D68B3ADAEE06F
	 */
	struct UGA_SheatheUnsheathe_C_OnBlendOut_D9A64E7041F226349F9D68B3ADAEE06F_Params
	{	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.OnCompleted_D9A64E7041F226349F9D68B3ADAEE06F
	 */
	struct UGA_SheatheUnsheathe_C_OnCompleted_D9A64E7041F226349F9D68B3ADAEE06F_Params
	{	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.EventReceived_048CA3CF48FB79A849F8A796EAA9ED14
	 */
	struct UGA_SheatheUnsheathe_C_EventReceived_048CA3CF48FB79A849F8A796EAA9ED14_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.EventReceived_FB3668DE494044FF4D52DB82B03653A9
	 */
	struct UGA_SheatheUnsheathe_C_EventReceived_FB3668DE494044FF4D52DB82B03653A9_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.EventReceived_FC3D490E403E6EB1B0759AAF43F8EDCF
	 */
	struct UGA_SheatheUnsheathe_C_EventReceived_FC3D490E403E6EB1B0759AAF43F8EDCF_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.EventReceived_FC9655F649AFBC5DC73DCDA4F9807AE0
	 */
	struct UGA_SheatheUnsheathe_C_EventReceived_FC9655F649AFBC5DC73DCDA4F9807AE0_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.EventReceived_442C4DE946563B42EA7C778250B22A34
	 */
	struct UGA_SheatheUnsheathe_C_EventReceived_442C4DE946563B42EA7C778250B22A34_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.EventReceived_538F7B0B4F60120D485FAB97DE934D2F
	 */
	struct UGA_SheatheUnsheathe_C_EventReceived_538F7B0B4F60120D485FAB97DE934D2F_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.EventReceived_2F0316CD4DD13C9E0C8CD299CE8DB89E
	 */
	struct UGA_SheatheUnsheathe_C_EventReceived_2F0316CD4DD13C9E0C8CD299CE8DB89E_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.EventReceived_25EDE76541BDB9CFBEBC65A7549845C3
	 */
	struct UGA_SheatheUnsheathe_C_EventReceived_25EDE76541BDB9CFBEBC65A7549845C3_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.EventReceived_6BD0338042F89525D9F85BA0454BDCB7
	 */
	struct UGA_SheatheUnsheathe_C_EventReceived_6BD0338042F89525D9F85BA0454BDCB7_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.OnCancelled_D21237974BA97FC81AAB6EAB35A56695
	 */
	struct UGA_SheatheUnsheathe_C_OnCancelled_D21237974BA97FC81AAB6EAB35A56695_Params
	{	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.OnInterrupted_D21237974BA97FC81AAB6EAB35A56695
	 */
	struct UGA_SheatheUnsheathe_C_OnInterrupted_D21237974BA97FC81AAB6EAB35A56695_Params
	{	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.OnBlendOut_D21237974BA97FC81AAB6EAB35A56695
	 */
	struct UGA_SheatheUnsheathe_C_OnBlendOut_D21237974BA97FC81AAB6EAB35A56695_Params
	{	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.OnCompleted_D21237974BA97FC81AAB6EAB35A56695
	 */
	struct UGA_SheatheUnsheathe_C_OnCompleted_D21237974BA97FC81AAB6EAB35A56695_Params
	{	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.OnCancelled_9A92F6DE4CF309E62D84C5B36B8BD1F4
	 */
	struct UGA_SheatheUnsheathe_C_OnCancelled_9A92F6DE4CF309E62D84C5B36B8BD1F4_Params
	{	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.OnInterrupted_9A92F6DE4CF309E62D84C5B36B8BD1F4
	 */
	struct UGA_SheatheUnsheathe_C_OnInterrupted_9A92F6DE4CF309E62D84C5B36B8BD1F4_Params
	{	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.OnBlendOut_9A92F6DE4CF309E62D84C5B36B8BD1F4
	 */
	struct UGA_SheatheUnsheathe_C_OnBlendOut_9A92F6DE4CF309E62D84C5B36B8BD1F4_Params
	{	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.OnCompleted_9A92F6DE4CF309E62D84C5B36B8BD1F4
	 */
	struct UGA_SheatheUnsheathe_C_OnCompleted_9A92F6DE4CF309E62D84C5B36B8BD1F4_Params
	{	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.EventReceived_E26303E940B02991FFB572B4EC5F1048
	 */
	struct UGA_SheatheUnsheathe_C_EventReceived_E26303E940B02991FFB572B4EC5F1048_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.EventReceived_6AB2EF43434917E3FCA38FBB71810E43
	 */
	struct UGA_SheatheUnsheathe_C_EventReceived_6AB2EF43434917E3FCA38FBB71810E43_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.K2_OnEndAbility
	 */
	struct UGA_SheatheUnsheathe_C_K2_OnEndAbility_Params
	{
	public:
		bool                                                       bWasCancelled;                                           // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.Equip
	 */
	struct UGA_SheatheUnsheathe_C_Equip_Params
	{	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.Unequip
	 */
	struct UGA_SheatheUnsheathe_C_Unequip_Params
	{	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.Equip Primary
	 */
	struct UGA_SheatheUnsheathe_C_Equip_Primary_Params
	{	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.Equip Secondary
	 */
	struct UGA_SheatheUnsheathe_C_Equip_Secondary_Params
	{	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.K2_ActivateAbilityFromEvent
	 */
	struct UGA_SheatheUnsheathe_C_K2_ActivateAbilityFromEvent_Params
	{
	public:
		struct FGameplayEventData                                  EventData;                                               // 0x0000(0x00B0)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.Switch Shield On
	 */
	struct UGA_SheatheUnsheathe_C_Switch_Shield_On_Params
	{	};

	/**
	 * Function GA_SheatheUnsheathe.GA_SheatheUnsheathe_C.ExecuteUbergraph_GA_SheatheUnsheathe
	 */
	struct UGA_SheatheUnsheathe_C_ExecuteUbergraph_GA_SheatheUnsheathe_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_ZRE1[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
