#pragma once

/**
 * Name: Agartha
 * Version: 1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.EventReceived_BF05C3D94EFC6AABE1A20496CF60B7D8
	 */
	struct UGA_ZombieAttack_C_EventReceived_BF05C3D94EFC6AABE1A20496CF60B7D8_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.EventReceived_94607F0949290434CDBA518A4E9CFDFC
	 */
	struct UGA_ZombieAttack_C_EventReceived_94607F0949290434CDBA518A4E9CFDFC_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.EventReceived_F5319D1349AB16C42A06FFB12C1B4BD5
	 */
	struct UGA_ZombieAttack_C_EventReceived_F5319D1349AB16C42A06FFB12C1B4BD5_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.OnCancelled_5ABCDF8A43C75EBC60B8A9A88499B0CF
	 */
	struct UGA_ZombieAttack_C_OnCancelled_5ABCDF8A43C75EBC60B8A9A88499B0CF_Params
	{	};

	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.OnInterrupted_5ABCDF8A43C75EBC60B8A9A88499B0CF
	 */
	struct UGA_ZombieAttack_C_OnInterrupted_5ABCDF8A43C75EBC60B8A9A88499B0CF_Params
	{	};

	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.OnBlendOut_5ABCDF8A43C75EBC60B8A9A88499B0CF
	 */
	struct UGA_ZombieAttack_C_OnBlendOut_5ABCDF8A43C75EBC60B8A9A88499B0CF_Params
	{	};

	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.OnCompleted_5ABCDF8A43C75EBC60B8A9A88499B0CF
	 */
	struct UGA_ZombieAttack_C_OnCompleted_5ABCDF8A43C75EBC60B8A9A88499B0CF_Params
	{	};

	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.OnCancelled_4F2BB68049790F16282FCF95B91A598B
	 */
	struct UGA_ZombieAttack_C_OnCancelled_4F2BB68049790F16282FCF95B91A598B_Params
	{	};

	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.OnInterrupted_4F2BB68049790F16282FCF95B91A598B
	 */
	struct UGA_ZombieAttack_C_OnInterrupted_4F2BB68049790F16282FCF95B91A598B_Params
	{	};

	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.OnBlendOut_4F2BB68049790F16282FCF95B91A598B
	 */
	struct UGA_ZombieAttack_C_OnBlendOut_4F2BB68049790F16282FCF95B91A598B_Params
	{	};

	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.OnCompleted_4F2BB68049790F16282FCF95B91A598B
	 */
	struct UGA_ZombieAttack_C_OnCompleted_4F2BB68049790F16282FCF95B91A598B_Params
	{	};

	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.OnCancelled_AE23F94C402AD9B75997C3A94BBF2496
	 */
	struct UGA_ZombieAttack_C_OnCancelled_AE23F94C402AD9B75997C3A94BBF2496_Params
	{	};

	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.OnInterrupted_AE23F94C402AD9B75997C3A94BBF2496
	 */
	struct UGA_ZombieAttack_C_OnInterrupted_AE23F94C402AD9B75997C3A94BBF2496_Params
	{	};

	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.OnBlendOut_AE23F94C402AD9B75997C3A94BBF2496
	 */
	struct UGA_ZombieAttack_C_OnBlendOut_AE23F94C402AD9B75997C3A94BBF2496_Params
	{	};

	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.OnCompleted_AE23F94C402AD9B75997C3A94BBF2496
	 */
	struct UGA_ZombieAttack_C_OnCompleted_AE23F94C402AD9B75997C3A94BBF2496_Params
	{	};

	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.OnFinish_E5A17C274AE37DDBF395C39702220D58
	 */
	struct UGA_ZombieAttack_C_OnFinish_E5A17C274AE37DDBF395C39702220D58_Params
	{	};

	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.OnCancelled_35F82D93495C154A0E0BE29B95F4A56A
	 */
	struct UGA_ZombieAttack_C_OnCancelled_35F82D93495C154A0E0BE29B95F4A56A_Params
	{	};

	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.OnInterrupted_35F82D93495C154A0E0BE29B95F4A56A
	 */
	struct UGA_ZombieAttack_C_OnInterrupted_35F82D93495C154A0E0BE29B95F4A56A_Params
	{	};

	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.OnBlendOut_35F82D93495C154A0E0BE29B95F4A56A
	 */
	struct UGA_ZombieAttack_C_OnBlendOut_35F82D93495C154A0E0BE29B95F4A56A_Params
	{	};

	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.OnCompleted_35F82D93495C154A0E0BE29B95F4A56A
	 */
	struct UGA_ZombieAttack_C_OnCompleted_35F82D93495C154A0E0BE29B95F4A56A_Params
	{	};

	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.OnFinish_0EFD929040E8B066013702BBF47DE5EC
	 */
	struct UGA_ZombieAttack_C_OnFinish_0EFD929040E8B066013702BBF47DE5EC_Params
	{	};

	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.EventReceived_3710E133432F1D9F2067B085326FF1CA
	 */
	struct UGA_ZombieAttack_C_EventReceived_3710E133432F1D9F2067B085326FF1CA_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.K2_ActivateAbility
	 */
	struct UGA_ZombieAttack_C_K2_ActivateAbility_Params
	{	};

	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.K2_OnEndAbility
	 */
	struct UGA_ZombieAttack_C_K2_OnEndAbility_Params
	{
	public:
		bool                                                       bWasCancelled;                                           // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.Add Knockback
	 */
	struct UGA_ZombieAttack_C_Add_Knockback_Params
	{
	public:
		float                                                      Radius;                                                  // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function GA_ZombieAttack.GA_ZombieAttack_C.ExecuteUbergraph_GA_ZombieAttack
	 */
	struct UGA_ZombieAttack_C_ExecuteUbergraph_GA_ZombieAttack_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_QB1D[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
