#pragma once

/**
 * Name: Agartha
 * Version: 1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function ProjectAgartha.AgarthaPlayfabFunctionLibrary.WithEditor
	 */
	struct UAgarthaPlayfabFunctionLibrary_WithEditor_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.AgarthaPlayfabFunctionLibrary.UsePlayFab
	 */
	struct UAgarthaPlayfabFunctionLibrary_UsePlayFab_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.AgarthaPlayfabFunctionLibrary.IsSteamLoginEnable
	 */
	struct UAgarthaPlayfabFunctionLibrary_IsSteamLoginEnable_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.AgarthaPlayfabFunctionLibrary.GetSteamLoginAuthToken
	 */
	struct UAgarthaPlayfabFunctionLibrary_GetSteamLoginAuthToken_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.AgathaPlayfabUtils.LoginWithSteam
	 */
	struct UAgathaPlayfabUtils_LoginWithSteam_Params
	{
	public:
		bool                                                       CreateAccount;                                           // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       LoggedInCheck;                                           // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0002(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.AgathaPlayfabUtils.LoginWithCustomID
	 */
	struct UAgathaPlayfabUtils_LoginWithCustomID_Params
	{
	public:
		class FString                                              CustomID;                                                // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       CreateAccount;                                           // 0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       LoggedInCheck;                                           // 0x0011(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0012(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.AgathaPlayfabUtils.IsClientLoggedIn
	 */
	struct UAgathaPlayfabUtils_IsClientLoggedIn_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.ArmorNoiseComponent.NotifyNearbyBots
	 */
	struct UArmorNoiseComponent_NotifyNearbyBots_Params
	{
	public:
		float                                                      OverrideDistance;                                        // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.ArmorNoiseComponent.MakeNoise
	 */
	struct UArmorNoiseComponent_MakeNoise_Params
	{
	public:
		EArmorNoise                                                NoiseLine;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bIsPriority;                                             // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.ArmorNoiseComponent.LoadNoises
	 */
	struct UArmorNoiseComponent_LoadNoises_Params
	{
	public:
		unsigned char                                              ArmorWeight;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.ATCustomWaitVelocityChange.CreateWaitVelocityChange
	 */
	struct UATCustomWaitVelocityChange_CreateWaitVelocityChange_Params
	{
	public:
		class UGameplayAbility*                                    OwningAbility;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      DotThreshold;                                            // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      MagnitudeThreshold;                                      // 0x000C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReportZeroVelocity;                                      // 0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_6CS5[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      NearZeroThreshold;                                       // 0x0014(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UATCustomWaitVelocityChange*                         ReturnValue;                                             // 0x0018(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BinarySerializer.UpdateAchievement
	 */
	struct UBinarySerializer_UpdateAchievement_Params
	{
	public:
		EAchievement                                               Achievement;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_CVKF[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      Progress;                                                // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BinarySerializer.SaveSessionToFileAsGameInstance
	 */
	struct UBinarySerializer_SaveSessionToFileAsGameInstance_Params
	{
	public:
		class FString                                              RaidURL;                                                 // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UProjectAgarthaGameInstance*                         GameInstance;                                            // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BinarySerializer.SaveSessionToFile
	 */
	struct UBinarySerializer_SaveSessionToFile_Params
	{
	public:
		class FString                                              RaidURL;                                                 // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              WorldContext;                                            // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BinarySerializer.SaveNPCsStateToPlayfab
	 */
	struct UBinarySerializer_SaveNPCsStateToPlayfab_Params
	{
	public:
		class AProjectAgarthaCharacter*                            Pawn;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UCharacterNPCsComponent*                             CharacterNPCsComponent;                                  // 0x0008(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BinarySerializer.SaveInventoryToPlayfabAsFreebooter
	 */
	struct UBinarySerializer_SaveInventoryToPlayfabAsFreebooter_Params
	{
	public:
		class ACombatEntity*                                       Pawn;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bForgetRaid;                                             // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BinarySerializer.SaveInventoryToPlayfab
	 */
	struct UBinarySerializer_SaveInventoryToPlayfab_Params
	{
	public:
		class ACombatEntity*                                       Pawn;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bForgetRaid;                                             // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BinarySerializer.SaveAppearanceToPlayfab
	 */
	struct UBinarySerializer_SaveAppearanceToPlayfab_Params
	{
	public:
		class AProjectAgarthaCharacter*                            Pawn;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UCharacterModularComponent*                          ModularComponent;                                        // 0x0008(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BinarySerializer.LogEvent
	 */
	struct UBinarySerializer_LogEvent_Params
	{
	public:
		class ACombatEntity*                                       Pawn;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EAnalyticEvent                                             EventType;                                               // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_R91F[0x7];                                   // 0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              OptionalKey;                                             // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              OptionalValue;                                           // 0x0020(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BinarySerializer.LoadSessionFromFileAsGameInstance
	 */
	struct UBinarySerializer_LoadSessionFromFileAsGameInstance_Params
	{
	public:
		class UProjectAgarthaGameInstance*                         GameInstance;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BinarySerializer.LoadSessionFromFile
	 */
	struct UBinarySerializer_LoadSessionFromFile_Params
	{
	public:
		class AActor*                                              WorldContext;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BinarySerializer.LoadNPCsStateFromPlayfab
	 */
	struct UBinarySerializer_LoadNPCsStateFromPlayfab_Params
	{
	public:
		class AProjectAgarthaCharacter*                            Pawn;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UCharacterNPCsComponent*                             CharacterNPCsComponent;                                  // 0x0008(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BinarySerializer.LoadInventoryFromPlayfab
	 */
	struct UBinarySerializer_LoadInventoryFromPlayfab_Params
	{
	public:
		class ACombatEntity*                                       Pawn;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BinarySerializer.LoadAppearanceFromPlayfabForCreator
	 */
	struct UBinarySerializer_LoadAppearanceFromPlayfabForCreator_Params
	{
	public:
		class FString                                              BackendID;                                               // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AProjectAgarthaCharacter*                            CharacterActor;                                          // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BinarySerializer.LoadAppearanceFromPlayfab
	 */
	struct UBinarySerializer_LoadAppearanceFromPlayfab_Params
	{
	public:
		class AProjectAgarthaCharacter*                            Pawn;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UCharacterModularComponent*                          ModularComponent;                                        // 0x0008(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BinarySerializer.Authorize
	 */
	struct UBinarySerializer_Authorize_Params
	{
	public:
		class AProjectAgarthaCharacter*                            Pawn;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              Token;                                                   // 0x0008(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              PartyString;                                             // 0x0018(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BotSpawnNode.OnSpawnTick
	 */
	struct ABotSpawnNode_OnSpawnTick_Params
	{	};

	/**
	 * Function ProjectAgartha.BotSpawnNode.OnSpawnNewZombieBegin
	 */
	struct ABotSpawnNode_OnSpawnNewZombieBegin_Params
	{
	public:
		struct FVector                                             BotLocation;                                             // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_U3N9[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UBoxComponent*                                       ComponentSpawnedFrom;                                    // 0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BotSpawnNode.OnSpawnNewRabbitBegin
	 */
	struct ABotSpawnNode_OnSpawnNewRabbitBegin_Params
	{
	public:
		struct FVector                                             BotLocation;                                             // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_APR2[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UBoxComponent*                                       ComponentSpawnedFrom;                                    // 0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BotSpawnNode.OnSpawnNewGoatBegin
	 */
	struct ABotSpawnNode_OnSpawnNewGoatBegin_Params
	{
	public:
		struct FVector                                             BotLocation;                                             // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_26IK[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UBoxComponent*                                       ComponentSpawnedFrom;                                    // 0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BotSpawnNode.OnSpawnNewCorruptZombieBegin
	 */
	struct ABotSpawnNode_OnSpawnNewCorruptZombieBegin_Params
	{
	public:
		struct FVector                                             BotLocation;                                             // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_9432[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UBoxComponent*                                       ComponentSpawnedFrom;                                    // 0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BotSpawnNode.OnSpawnNewBotEnd
	 */
	struct ABotSpawnNode_OnSpawnNewBotEnd_Params
	{
	public:
		class ACombatEntity*                                       NewBot;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UBoxComponent*                                       ComponentSpawnedFrom;                                    // 0x0008(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BotSpawnNode.OnSpawnNewBotBegin
	 */
	struct ABotSpawnNode_OnSpawnNewBotBegin_Params
	{
	public:
		struct FVector                                             BotLocation;                                             // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_M09S[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UBoxComponent*                                       ComponentSpawnedFrom;                                    // 0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BotSpawnNode.OnSpawnNewBoarBegin
	 */
	struct ABotSpawnNode_OnSpawnNewBoarBegin_Params
	{
	public:
		struct FVector                                             BotLocation;                                             // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_V8BM[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UBoxComponent*                                       ComponentSpawnedFrom;                                    // 0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BotSpawnNode.OnSpawnNewAsuraBegin
	 */
	struct ABotSpawnNode_OnSpawnNewAsuraBegin_Params
	{
	public:
		struct FVector                                             BotLocation;                                             // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_V78U[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UBoxComponent*                                       ComponentSpawnedFrom;                                    // 0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BotSpawnNode.OnOverlapEnd
	 */
	struct ABotSpawnNode_OnOverlapEnd_Params
	{
	public:
		class AActor*                                              OverlappedActor;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              OtherActor;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BotSpawnNode.OnOverlapBegin
	 */
	struct ABotSpawnNode_OnOverlapBegin_Params
	{
	public:
		class AActor*                                              OverlappedActor;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              OtherActor;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.BotSpawnNode.Async_FindBotLocation
	 */
	struct ABotSpawnNode_Async_FindBotLocation_Params
	{
	public:
		class FScriptDelegate                                      Out;                                                     // 0x0000(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
		TArray<struct FTransform>                                  BadTransforms;                                           // 0x0010(0x0010)  (Parm, ZeroConstructor, NativeAccessSpecifierPublic)
		struct FTransform                                          NodeOrigin;                                              // 0x0020(0x0030)  (Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		class UWorld*                                              World;                                                   // 0x0050(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<struct FTransform>                                  Components;                                              // 0x0058(0x0010)  (Parm, ZeroConstructor, NativeAccessSpecifierPublic)
		TMap<class UBoxComponent*, int32_t>                        AsyncSpawnCount;                                         // 0x0068(0x0050)  (Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterArmorComponent.OnUnequipArmor
	 */
	struct UCharacterArmorComponent_OnUnequipArmor_Params
	{
	public:
		ECharacterModuleType                                       Module;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_25S3[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		TArray<ECharacterModuleType>                               ShowModules;                                             // 0x0008(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterArmorComponent.OnEquipArmor
	 */
	struct UCharacterArmorComponent_OnEquipArmor_Params
	{
	public:
		ECharacterModuleType                                       Module;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_QPVU[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		TArray<ECharacterModuleType>                               HideModules;                                             // 0x0008(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
		int32_t                                                    BodyType;                                                // 0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_ZD5L[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FItemTable                                          ItemData;                                                // 0x0020(0x02A0)  (Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterArmorComponent.OnArmorUpdate
	 */
	struct UCharacterArmorComponent_OnArmorUpdate_Params
	{	};

	/**
	 * Function ProjectAgartha.CharacterBase.OnRep_Death
	 */
	struct ACharacterBase_OnRep_Death_Params
	{
	public:
		bool                                                       OldValue;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterBase.OnDeathCharacter
	 */
	struct ACharacterBase_OnDeathCharacter_Params
	{	};

	/**
	 * Function ProjectAgartha.CharacterBase.On_Death
	 */
	struct ACharacterBase_On_Death_Params
	{	};

	/**
	 * Function ProjectAgartha.CharacterBase.GiveGameplayAbility
	 */
	struct ACharacterBase_GiveGameplayAbility_Params
	{
	public:
		class UClass*                                              AbilityToGive;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterBase.BP_PlayerDied
	 */
	struct ACharacterBase_BP_PlayerDied_Params
	{	};

	/**
	 * Function ProjectAgartha.CharacterHistoryComponent.TrackStat
	 */
	struct UCharacterHistoryComponent_TrackStat_Params
	{
	public:
		EPlayerStat                                                Stat;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_I0PB[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    Amount;                                                  // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterHistoryComponent.GetStat
	 */
	struct UCharacterHistoryComponent_GetStat_Params
	{
	public:
		EPlayerStat                                                Stat;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_XP7E[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    ReturnValue;                                             // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterHistoryComponent.GetSessionStats
	 */
	struct UCharacterHistoryComponent_GetSessionStats_Params
	{
	public:
		struct FPlayerStats                                        ReturnValue;                                             // 0x0000(0x004C)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterHistoryComponent.GetHistoryOfKills
	 */
	struct UCharacterHistoryComponent_GetHistoryOfKills_Params
	{
	public:
		TArray<struct FKillHistory>                                Kills;                                                   // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterHistoryComponent.GetArchivedStats
	 */
	struct UCharacterHistoryComponent_GetArchivedStats_Params
	{
	public:
		struct FPlayerStats                                        ReturnValue;                                             // 0x0000(0x004C)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterHistoryComponent.Client_StatsChange
	 */
	struct UCharacterHistoryComponent_Client_StatsChange_Params
	{
	public:
		int32_t                                                    PlayerKills;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    NPCKills;                                                // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    Networth;                                                // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterHistoryComponent.Client_KillerSet
	 */
	struct UCharacterHistoryComponent_Client_KillerSet_Params
	{
	public:
		class FName                                                Name;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<struct FDamageHistory>                              historyDamage;                                           // 0x0008(0x0010)  (ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
		TArray<struct FKillHistory>                                historyKills;                                            // 0x0018(0x0010)  (ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterHistoryComponent.ArchiveStats
	 */
	struct UCharacterHistoryComponent_ArchiveStats_Params
	{	};

	/**
	 * Function ProjectAgartha.CharacterModularComponent.UpdateCharacterMesh
	 */
	struct UCharacterModularComponent_UpdateCharacterMesh_Params
	{	};

	/**
	 * Function ProjectAgartha.CharacterModularComponent.SetCharacterBody
	 */
	struct UCharacterModularComponent_SetCharacterBody_Params
	{
	public:
		struct FCharacterBody                                      CharacterNewBody;                                        // 0x0000(0x0060)  (Parm, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0060(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterModularComponent.GetCharacterBody
	 */
	struct UCharacterModularComponent_GetCharacterBody_Params
	{
	public:
		struct FCharacterBody                                      ReturnValue;                                             // 0x0000(0x0060)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterNPCsComponent.UpdateQuestState
	 */
	struct UCharacterNPCsComponent_UpdateQuestState_Params
	{
	public:
		class FName                                                QuestName;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterNPCsComponent.Server_FirstTalkFinished
	 */
	struct UCharacterNPCsComponent_Server_FirstTalkFinished_Params
	{
	public:
		class UNPCComponent*                                       NPCComponent;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterNPCsComponent.Server_FinishQuest
	 */
	struct UCharacterNPCsComponent_Server_FinishQuest_Params
	{
	public:
		class UNPCComponent*                                       NPCComponent;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                QuestName;                                               // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterNPCsComponent.Server_ClearQuests
	 */
	struct UCharacterNPCsComponent_Server_ClearQuests_Params
	{
	public:
		bool                                                       ResetMerchants;                                          // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterNPCsComponent.OverlappedQuestPoint
	 */
	struct UCharacterNPCsComponent_OverlappedQuestPoint_Params
	{
	public:
		class FName                                                QuestPoint;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterNPCsComponent.OnRep_NPCLevels
	 */
	struct UCharacterNPCsComponent_OnRep_NPCLevels_Params
	{	};

	/**
	 * Function ProjectAgartha.CharacterNPCsComponent.NPCQuestProgress
	 */
	struct UCharacterNPCsComponent_NPCQuestProgress_Params
	{
	public:
		class FName                                                QuestName;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FProjectAgartha_FNPCQuestProgress                   Progress;                                                // 0x0008(0x0020)  (Parm, OutParm, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0028(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterNPCsComponent.GetQuestState
	 */
	struct UCharacterNPCsComponent_GetQuestState_Params
	{
	public:
		class FName                                                QuestName;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EQuestProgressType                                         ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterNPCsComponent.GetQuestInfo
	 */
	struct UCharacterNPCsComponent_GetQuestInfo_Params
	{
	public:
		class FName                                                QuestName;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FQuestTable                                         QuestRow;                                                // 0x0008(0x00D0)  (Parm, OutParm, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x00D8(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterNPCsComponent.GetItemInfo
	 */
	struct UCharacterNPCsComponent_GetItemInfo_Params
	{
	public:
		class FName                                                ItemRowName;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_G427[0x8];                                   // 0x0008(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FItemTable                                          ItemRow;                                                 // 0x0010(0x02A0)  (Parm, OutParm, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x02B0(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterNPCsComponent.FindNPCQuestInProgress
	 */
	struct UCharacterNPCsComponent_FindNPCQuestInProgress_Params
	{
	public:
		class FName                                                NPCName;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                QuestName;                                               // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FProjectAgartha_FNPCQuestProgress                   QuestProgress;                                           // 0x0010(0x0020)  (Parm, OutParm, NativeAccessSpecifierPublic)
		int32_t                                                    ReturnValue;                                             // 0x0030(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterNPCsComponent.FindNPCLevel
	 */
	struct UCharacterNPCsComponent_FindNPCLevel_Params
	{
	public:
		class FName                                                NPCName;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FNPCLevel                                           NPCLevel;                                                // 0x0008(0x0010)  (Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterNPCsComponent.FindItems
	 */
	struct UCharacterNPCsComponent_FindItems_Params
	{
	public:
		class FName                                                ItemName;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<struct FQuestItemsStat>                             ItemStats;                                               // 0x0008(0x0010)  (Parm, ZeroConstructor, NativeAccessSpecifierPublic)
		int32_t                                                    ReturnValue;                                             // 0x0018(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterNPCsComponent.EventQuestResult
	 */
	struct UCharacterNPCsComponent_EventQuestResult_Params
	{
	public:
		EQuestActionResult                                         Result;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_IFHI[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FName                                                QuestName;                                               // 0x0004(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterNPCsComponent.Client_Quest_Result
	 */
	struct UCharacterNPCsComponent_Client_Quest_Result_Params
	{
	public:
		EQuestActionResult                                         Result;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_MGQX[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FName                                                QuestName;                                               // 0x0004(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterNPCsComponent.ClearQuests
	 */
	struct UCharacterNPCsComponent_ClearQuests_Params
	{
	public:
		bool                                                       ResetMerchants;                                          // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CharacterTravelingComponent.OnRep_SpawnGroup
	 */
	struct UCharacterTravelingComponent_OnRep_SpawnGroup_Params
	{	};

	/**
	 * Function ProjectAgartha.CharacterTravelingComponent.MoveToSpawn
	 */
	struct UCharacterTravelingComponent_MoveToSpawn_Params
	{	};

	/**
	 * Function ProjectAgartha.CharacterWeaponsComponent.OnWeaponUpdate
	 */
	struct UCharacterWeaponsComponent_OnWeaponUpdate_Params
	{	};

	/**
	 * Function ProjectAgartha.ChatSubsystem.SendMessage_3
	 */
	struct UChatSubsystem_SendMessage_3_Params
	{
	public:
		EChatChannel                                               _Channel;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_3PQ7[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              _Name;                                                   // 0x0008(0x0010)  (ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              _Message;                                                // 0x0018(0x0010)  (ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.ChatSubsystem.SendMessage
	 */
	struct UChatSubsystem_SendMessage_Params
	{
	public:
		struct FChatLine                                           ChatLine;                                                // 0x0000(0x0028)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.ChatSubsystem.ReceivedMessage
	 */
	struct UChatSubsystem_ReceivedMessage_Params
	{
	public:
		struct FChatLine                                           ChatLine;                                                // 0x0000(0x0028)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.ChatSubsystem.MuteChannel
	 */
	struct UChatSubsystem_MuteChannel_Params
	{
	public:
		EChatChannel                                               Channel;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bMuted;                                                  // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.ChatSubsystem.GetAllLinesFromChannel
	 */
	struct UChatSubsystem_GetAllLinesFromChannel_Params
	{
	public:
		EChatChannel                                               Channel;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_LE8G[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		TArray<struct FChatLine>                                   ReturnValue;                                             // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.ChatSubsystem.FormatLine
	 */
	struct UChatSubsystem_FormatLine_Params
	{
	public:
		struct FChatLine                                           ChatLine;                                                // 0x0000(0x0028)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FString                                              ReturnValue;                                             // 0x0028(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.PlayerCharacter.InitializeAbilityBindings
	 */
	struct APlayerCharacter_InitializeAbilityBindings_Params
	{	};

	/**
	 * Function ProjectAgartha.CombatEntity.UpdateStanceAndType
	 */
	struct ACombatEntity_UpdateStanceAndType_Params
	{
	public:
		EWeaponType                                                NewWeaponType;                                           // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CombatEntity.UpdateExtractionBasedOnParty
	 */
	struct ACombatEntity_UpdateExtractionBasedOnParty_Params
	{
	public:
		bool                                                       bMoveToSpawnWhenComplete;                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CombatEntity.TryPerformJump
	 */
	struct ACombatEntity_TryPerformJump_Params
	{	};

	/**
	 * Function ProjectAgartha.CombatEntity.SetStance
	 */
	struct ACombatEntity_SetStance_Params
	{
	public:
		ECharacterStance                                           CStance;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CombatEntity.Server_UseActionInventory
	 */
	struct ACombatEntity_Server_UseActionInventory_Params
	{
	public:
		class UInventoryComponent*                                 ActionInventory;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CombatEntity.Server_UseAction
	 */
	struct ACombatEntity_Server_UseAction_Params
	{
	public:
		struct FVector                                             Begin;                                                   // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                             End;                                                     // 0x000C(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CombatEntity.Server_UpdateStash
	 */
	struct ACombatEntity_Server_UpdateStash_Params
	{
	public:
		class UItem*                                               StashItem;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CombatEntity.Server_Sheathe
	 */
	struct ACombatEntity_Server_Sheathe_Params
	{
	public:
		bool                                                       bIsFighting;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CombatEntity.Server_PlaceInWorld
	 */
	struct ACombatEntity_Server_PlaceInWorld_Params
	{
	public:
		class UItem*                                               Target;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UWorld*                                              World;                                                   // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                             WorldPosition;                                           // 0x0010(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CombatEntity.Server_PlaceInContainer
	 */
	struct ACombatEntity_Server_PlaceInContainer_Params
	{
	public:
		class UItem*                                               TargetItem;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AItemActor*                                          TargetItemActor;                                         // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UItem*                                               TargetContainer;                                         // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CombatEntity.Server_OnWeaponComponentStanceChange
	 */
	struct ACombatEntity_Server_OnWeaponComponentStanceChange_Params
	{
	public:
		bool                                                       bIsFighting;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EWeaponType                                                Weapon;                                                  // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CombatEntity.Server_OnWeaponComponentEquipmentChange
	 */
	struct ACombatEntity_Server_OnWeaponComponentEquipmentChange_Params
	{
	public:
		class UItem*                                               NewItem;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EquipmentType                                              ItemLocation;                                            // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CombatEntity.Server_OnSheatheAction
	 */
	struct ACombatEntity_Server_OnSheatheAction_Params
	{
	public:
		bool                                                       bIsFighting;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EWeaponType                                                Weapon;                                                  // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CombatEntity.Server_OnServerKick
	 */
	struct ACombatEntity_Server_OnServerKick_Params
	{	};

	/**
	 * Function ProjectAgartha.CombatEntity.Server_OnArmorComponentEquipmentChange
	 */
	struct ACombatEntity_Server_OnArmorComponentEquipmentChange_Params
	{
	public:
		class UItem*                                               NewItem;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UItem*                                               PrevItem;                                                // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EquipmentType                                              ItemLocation;                                            // 0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CombatEntity.Server_CraftRecipeOnTable
	 */
	struct ACombatEntity_Server_CraftRecipeOnTable_Params
	{
	public:
		struct FRecipeTable                                        Recipe;                                                  // 0x0000(0x0048)  (ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
		TArray<class UItem*>                                       Requirements;                                            // 0x0048(0x0010)  (ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
		class UCraftingComponent*                                  CraftTable;                                              // 0x0058(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    Repeats;                                                 // 0x0060(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProjectAgartha.CombatEntity.SaveInventory
	 */
	struct ACombatEntity_SaveInventory_Params
	{	};

	/**
	 * Function ProjectAgartha.CombatEntity.ReplicateStashDelayed
	 */
	struct ACombatEntity_ReplicateStashDelayed_Params
	{	};

	/**
	 * Function ProjectAgartha.CombatEntity.RemoveStats
	 */
	struct ACombatEntity_RemoveStats_Params
	{
	public:
