#pragma once

/**
 * Name: Agartha
 * Version: 1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class ProjectAgartha.AgarthaEffectUIData_cpp
	 * Size -> 0x0050 (FullSize[0x0078] - InheritedSize[0x0028])
	 */
	class UAgarthaEffectUIData_cpp : public UGameplayEffectUIData
	{
	public:
		class FText                                                Description;                                             // 0x0028(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		unsigned char                                              Icon[0x28];                                              // 0x0040(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		struct FLinearColor                                        IconTint;                                                // 0x0068(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProjectAgartha.AgarthaGlobals
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class UAgarthaGlobals : public UGameInstanceSubsystem
	{
	public:
		unsigned char                                              UnknownData_3AYU[0x8];                                   // 0x0030(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProjectAgartha.AgarthaPlayfabFunctionLibrary
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UAgarthaPlayfabFunctionLibrary : public UBlueprintFunctionLibrary
	{
	public:
		bool WithEditor();
		bool UsePlayFab();
		bool IsSteamLoginEnable();
		class FString GetSteamLoginAuthToken();
		static UClass* StaticClass();
	};

	/**
	 * Class ProjectAgartha.AgathaPlayfabUtils
	 * Size -> 0x0050 (FullSize[0x0078] - InheritedSize[0x0028])
	 */
	class UAgathaPlayfabUtils : public UObject
	{
	public:
		class FString                                              LastCustomID;                                            // 0x0028(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_HKNE[0x20];                                  // 0x0038(0x0020) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             OnPlayfabLoginSuccess;                                   // 0x0058(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnPlayfabLoginFailed;                                    // 0x0068(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic

	public:
		bool LoginWithSteam(bool CreateAccount, bool LoggedInCheck);
		bool LoginWithCustomID(const class FString& CustomID, bool CreateAccount, bool LoggedInCheck);
		bool IsClientLoggedIn();
		static UClass* StaticClass();
	};

	/**
	 * Class ProjectAgartha.ArmorNoiseComponent
	 * Size -> 0x0048 (FullSize[0x00F8] - InheritedSize[0x00B0])
	 */
	class UArmorNoiseComponent : public UActorComponent
	{
	public:
		unsigned char                                              LightArmorThreshold;                                     // 0x00B0(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              MediumArmorThreshold;                                    // 0x00B1(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              HeavyArmorThreshold;                                     // 0x00B2(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_PT1I[0x5];                                   // 0x00B3(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class ASimpleBot*>                                  NearbyBots;                                              // 0x00B8(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		struct FVector                                             NearbyBotCacheLocation;                                  // 0x00C8(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_UGDM[0x4];                                   // 0x00D4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UDataTable*                                          ArmorNoiseTablePointer;                                  // 0x00D8(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USoundAttenuation*                                   MyArmorAttenuation;                                      // 0x00E0(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1AVZ[0x8];                                   // 0x00E8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		unsigned char                                              MyArmorWeight;                                           // 0x00F0(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KI4I[0x7];                                   // 0x00F1(0x0007) MISSED OFFSET (PADDING)

	public:
		void NotifyNearbyBots(float OverrideDistance);
		void MakeNoise(EArmorNoise NoiseLine, bool bIsPriority);
		void LoadNoises(unsigned char ArmorWeight);
		static UClass* StaticClass();
	};

	/**
	 * Class ProjectAgartha.ATCustomWaitVelocityChange
	 * Size -> 0x0048 (FullSize[0x00C8] - InheritedSize[0x0080])
	 */
	class UATCustomWaitVelocityChange : public UAbilityTask
	{
	public:
		class FScriptMulticastDelegate                             OnVelocityChange;                                        // 0x0080(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate
		class UMovementComponent*                                  CachedMovementComponent;                                 // 0x0090(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class AActor*                                              Avatar;                                                  // 0x0098(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_G267[0x28];                                  // 0x00A0(0x0028) MISSED OFFSET (PADDING)

	public:
		class UATCustomWaitVelocityChange* CreateWaitVelocityChange(class UGameplayAbility* OwningAbility, float DotThreshold, float MagnitudeThreshold, bool ReportZeroVelocity, float NearZeroThreshold);
		static UClass* StaticClass();
	};

	/**
	 * Class ProjectAgartha.BinarySerializer
	 * Size -> 0x00B0 (FullSize[0x00D8] - InheritedSize[0x0028])
	 */
	class UBinarySerializer : public UObject
	{
	public:
		unsigned char                                              UnknownData_5JES[0x20];                                  // 0x0028(0x0020) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             OnInventoryLoaded;                                       // 0x0048(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnAppearanceLoaded;                                      // 0x0058(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnNPCsStateLoaded;                                       // 0x0068(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_L240[0x60];                                  // 0x0078(0x0060) MISSED OFFSET (PADDING)

	public:
		void UpdateAchievement(EAchievement Achievement, float Progress);
		void SaveSessionToFileAsGameInstance(const class FString& RaidURL, class UProjectAgarthaGameInstance* GameInstance);
		void SaveSessionToFile(const class FString& RaidURL, class AActor* WorldContext);
		void SaveNPCsStateToPlayfab(class AProjectAgarthaCharacter* Pawn, class UCharacterNPCsComponent* CharacterNPCsComponent);
		void SaveInventoryToPlayfabAsFreebooter(class ACombatEntity* Pawn, bool bForgetRaid);
		void SaveInventoryToPlayfab(class ACombatEntity* Pawn, bool bForgetRaid);
		void SaveAppearanceToPlayfab(class AProjectAgarthaCharacter* Pawn, class UCharacterModularComponent* ModularComponent);
		void LogEvent(class ACombatEntity* Pawn, EAnalyticEvent EventType, const class FString& OptionalKey, const class FString& OptionalValue);
		void LoadSessionFromFileAsGameInstance(class UProjectAgarthaGameInstance* GameInstance);
		void LoadSessionFromFile(class AActor* WorldContext);
		void LoadNPCsStateFromPlayfab(class AProjectAgarthaCharacter* Pawn, class UCharacterNPCsComponent* CharacterNPCsComponent);
		void LoadInventoryFromPlayfab(class ACombatEntity* Pawn);
		void LoadAppearanceFromPlayfabForCreator(const class FString& BackendID, class AProjectAgarthaCharacter* CharacterActor);
		void LoadAppearanceFromPlayfab(class AProjectAgarthaCharacter* Pawn, class UCharacterModularComponent* ModularComponent);
		void Authorize(class AProjectAgarthaCharacter* Pawn, const class FString& Token, const class FString& PartyString);
		static UClass* StaticClass();
	};

	/**
	 * Class ProjectAgartha.BlockedDamageType
	 * Size -> 0x0008 (FullSize[0x0048] - InheritedSize[0x0040])
	 */
	class UBlockedDamageType : public UDamageType
	{
	public:
		bool                                                       bIsHeavyAttack;                                          // 0x0040(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsPunch;                                                // 0x0041(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsKick;                                                 // 0x0042(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LL3D[0x5];                                   // 0x0043(0x0005) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProjectAgartha.BodyDamageType
	 * Size -> 0x0008 (FullSize[0x0048] - InheritedSize[0x0040])
	 */
	class UBodyDamageType : public UDamageType
	{
	public:
		bool                                                       bIsHeavyAttack;                                          // 0x0040(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsPunch;                                                // 0x0041(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsKick;                                                 // 0x0042(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_2QAU[0x5];                                   // 0x0043(0x0005) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProjectAgartha.BotSpawnNode
	 * Size -> 0x0170 (FullSize[0x0398] - InheritedSize[0x0228])
	 */
	class ABotSpawnNode : public ATriggerBox
	{
	public:
		unsigned char                                              UnknownData_CXEP[0x100];                                 // 0x0228(0x0100) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UDataTable*                                          PremadeBotsTable;                                        // 0x0328(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDataTable*                                          CorruptedZombieInventory;                                // 0x0330(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FTimerHandle                                        SpawnTick;                                               // 0x0338(0x0008) NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                    MaximumEntitiesInWorld;                                  // 0x0340(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MaximumCrowding;                                         // 0x0344(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SpawnCap;                                                // 0x0348(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SpawnPenalty;                                            // 0x034C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SpawnRecovery;                                           // 0x0350(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsRandom;                                               // 0x0354(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SPD4[0x3];                                   // 0x0355(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    Party;                                                   // 0x0358(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EBotStyle                                                  BotType;                                                 // 0x035C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KGW8[0x3];                                   // 0x035D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      BeginSpawningCorruptedAt;                                // 0x0360(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              DifficultyMinimum;                                       // 0x0364(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              DifficultyMaximum;                                       // 0x0365(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              PersonalityAggressivenessMinimum;                        // 0x0366(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              PersonalityAggressivenessMaximum;                        // 0x0367(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              PersonalityCuriousnessMinimum;                           // 0x0368(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              PersonalityCuriousnessMaximum;                           // 0x0369(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              PersonalityCowardiceMinimum;                             // 0x036A(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              PersonalityCowardiceMaximum;                             // 0x036B(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              PersonalityAgilityMinimum;                               // 0x036C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              PersonalityAgilityMaximum;                               // 0x036D(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              PersonalityConfidenceMinimum;                            // 0x036E(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              PersonalityConfidenceMaximum;                            // 0x036F(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              PersonalityScavengerMinimum;                             // 0x0370(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              PersonalityScavengerMaximum;                             // 0x0371(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UndeadChance;                                            // 0x0372(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SLVF[0x5];                                   // 0x0373(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class FName>                                        SpawnTable;                                              // 0x0378(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		class FName                                                UniqueSpawn;                                             // 0x0388(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    UniqueSpawnIndex;                                        // 0x0390(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_HI9I[0x4];                                   // 0x0394(0x0004) MISSED OFFSET (PADDING)

	public:
		void OnSpawnTick();
		void OnSpawnNewZombieBegin(const struct FVector& BotLocation, class UBoxComponent* ComponentSpawnedFrom);
		void OnSpawnNewRabbitBegin(const struct FVector& BotLocation, class UBoxComponent* ComponentSpawnedFrom);
		void OnSpawnNewGoatBegin(const struct FVector& BotLocation, class UBoxComponent* ComponentSpawnedFrom);
		void OnSpawnNewCorruptZombieBegin(const struct FVector& BotLocation, class UBoxComponent* ComponentSpawnedFrom);
		void OnSpawnNewBotEnd(class ACombatEntity* NewBot, class UBoxComponent* ComponentSpawnedFrom);
		void OnSpawnNewBotBegin(const struct FVector& BotLocation, class UBoxComponent* ComponentSpawnedFrom);
		void OnSpawnNewBoarBegin(const struct FVector& BotLocation, class UBoxComponent* ComponentSpawnedFrom);
		void OnSpawnNewAsuraBegin(const struct FVector& BotLocation, class UBoxComponent* ComponentSpawnedFrom);
		void OnOverlapEnd(class AActor* OverlappedActor, class AActor* OtherActor);
		void OnOverlapBegin(class AActor* OverlappedActor, class AActor* OtherActor);
		void Async_FindBotLocation(const class FScriptDelegate& Out, TArray<struct FTransform> BadTransforms, const struct FTransform& NodeOrigin, class UWorld* World, TArray<struct FTransform> Components, TMap<class UBoxComponent*, int32_t> AsyncSpawnCount);
		static UClass* StaticClass();
	};

	/**
	 * Class ProjectAgartha.CameraFreePawn
	 * Size -> 0x0008 (FullSize[0x0288] - InheritedSize[0x0280])
	 */
	class ACameraFreePawn : public APawn
	{
	public:
		class UCameraComponent*                                    Camera;                                                  // 0x0280(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProjectAgartha.CharacterArmorComponent
	 * Size -> 0x0000 (FullSize[0x00B0] - InheritedSize[0x00B0])
	 */
	class UCharacterArmorComponent : public UActorComponent
	{
	public:
		void OnUnequipArmor(ECharacterModuleType Module, TArray<ECharacterModuleType> ShowModules);
		void OnEquipArmor(ECharacterModuleType Module, TArray<ECharacterModuleType> HideModules, int32_t BodyType, const struct FItemTable& ItemData);
		void OnArmorUpdate();
		static UClass* StaticClass();
	};

	/**
	 * Class ProjectAgartha.CharacterBase
	 * Size -> 0x0078 (FullSize[0x0530] - InheritedSize[0x04B8])
	 */
	class ACharacterBase : public ACharacter
	{
	public:
		unsigned char                                              UnknownData_UH9L[0x8];                                   // 0x04B8(0x0008) Fix Super Size
		bool                                                       bIsWhitelisted;                                          // 0x04C0(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_HZ91[0x7];                                   // 0x04C1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UClass*>                                      DefaultAbilities;                                        // 0x04C8(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic
		TArray<class UClass*>                                      DefaultEffects;                                          // 0x04D8(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KVHZ[0x30];                                  // 0x04E8(0x0030) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAudioComponent*                                     LastSound;                                               // 0x0518(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bIsDead;                                                 // 0x0520(0x0001) BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_4649[0xF];                                   // 0x0521(0x000F) MISSED OFFSET (PADDING)

	public:
		void OnRep_Death(bool OldValue);
		void OnDeathCharacter();
		void On_Death();
		void GiveGameplayAbility(class UClass* AbilityToGive);
		void BP_PlayerDied();
		static UClass* StaticClass();
	};

	/**
	 * Class ProjectAgartha.CharacterHistoryComponent
	 * Size -> 0x0118 (FullSize[0x01C8] - InheritedSize[0x00B0])
	 */
	class UCharacterHistoryComponent : public UActorComponent
	{
	public:
		TArray<struct FDamageHistory>                              HistoryOfDamage;                                         // 0x00B0(0x0010) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<struct FKillHistory>                                HistoryOfKills;                                          // 0x00C0(0x0010) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Protected, NativeAccessSpecifierProtected
		class FName                                                KillerName;                                              // 0x00D0(0x0008) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_A8QW[0x8];                                   // 0x00D8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FPlayerStats                                        UnsavedStats;                                            // 0x00E0(0x004C) NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FPlayerStats                                        SessionStats;                                            // 0x012C(0x004C) BlueprintVisible, BlueprintReadOnly, Net, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FPlayerStats                                        ArchivedStats;                                           // 0x0178(0x004C) BlueprintVisible, BlueprintReadOnly, Net, NoDestructor, Protected, NativeAccessSpecifierProtected
		bool                                                       bWasTeamkilled;                                          // 0x01C4(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bWasBotkilled;                                           // 0x01C5(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_E7HM[0x2];                                   // 0x01C6(0x0002) MISSED OFFSET (PADDING)

	public:
		void TrackStat(EPlayerStat Stat, int32_t Amount);
		int32_t GetStat(EPlayerStat Stat);
		struct FPlayerStats GetSessionStats();
		void GetHistoryOfKills(TArray<struct FKillHistory>* Kills);
		struct FPlayerStats GetArchivedStats();
		void Client_StatsChange(int32_t PlayerKills, int32_t NPCKills, int32_t Networth);
		void Client_KillerSet(const class FName& Name, TArray<struct FDamageHistory> historyDamage, TArray<struct FKillHistory> historyKills);
		void ArchiveStats();
		static UClass* StaticClass();
	};

	/**
	 * Class ProjectAgartha.CharacterModularComponent
	 * Size -> 0x0060 (FullSize[0x0110] - InheritedSize[0x00B0])
	 */
	class UCharacterModularComponent : public UActorComponent
	{
	public:
		struct FCharacterBody                                      CharacterBody;                                           // 0x00B0(0x0060) BlueprintVisible, BlueprintReadOnly, Net, Protected, NativeAccessSpecifierProtected

	public:
		void UpdateCharacterMesh();
		bool SetCharacterBody(const struct FCharacterBody& CharacterNewBody);
		struct FCharacterBody GetCharacterBody();
		static UClass* StaticClass();
	};

	/**
	 * Class ProjectAgartha.CharacterNPCsComponent
	 * Size -> 0x0050 (FullSize[0x0100] - InheritedSize[0x00B0])
	 */
	class UCharacterNPCsComponent : public UActorComponent
	{
	public:
		class UDataTable*                                          QuestsTable;                                             // 0x00B0(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FNPCLevel>                                   NPCLevels;                                               // 0x00B8(0x0010) Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic
		TArray<struct FProjectAgartha_FNPCQuestProgress>           QuestsProgress;                                          // 0x00C8(0x0010) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_U5NW[0x4];                                   // 0x00D8(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                LastQuestNameFinished;                                   // 0x00DC(0x0008) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                LastQuestNameToPropose;                                  // 0x00E4(0x0008) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FNPCLevel                                           DefaultLevel;                                            // 0x00EC(0x0010) NoDestructor, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_YPDS[0x4];                                   // 0x00FC(0x0004) MISSED OFFSET (PADDING)

	public:
		bool UpdateQuestState(const class FName& QuestName);
		void Server_FirstTalkFinished(class UNPCComponent* NPCComponent);
		void Server_FinishQuest(class UNPCComponent* NPCComponent, const class FName& QuestName);
		void Server_ClearQuests(bool ResetMerchants);
		bool OverlappedQuestPoint(const class FName& QuestPoint);
		void OnRep_NPCLevels();
		bool NPCQuestProgress(const class FName& QuestName, struct FProjectAgartha_FNPCQuestProgress* Progress);
		EQuestProgressType GetQuestState(const class FName& QuestName);
		bool GetQuestInfo(const class FName& QuestName, struct FQuestTable* QuestRow);
		bool GetItemInfo(const class FName& ItemRowName, struct FItemTable* ItemRow);
		int32_t FindNPCQuestInProgress(const class FName& NPCName, const class FName& QuestName, struct FProjectAgartha_FNPCQuestProgress* QuestProgress);
		bool FindNPCLevel(const class FName& NPCName, struct FNPCLevel* NPCLevel);
		int32_t FindItems(const class FName& ItemName, TArray<struct FQuestItemsStat> ItemStats);
		void EventQuestResult(EQuestActionResult Result, const class FName& QuestName);
		void Client_Quest_Result(EQuestActionResult Result, const class FName& QuestName);
		void ClearQuests(bool ResetMerchants);
		static UClass* StaticClass();
	};

	/**
	 * Class ProjectAgartha.CharacterTravelingComponent
	 * Size -> 0x0008 (FullSize[0x00B8] - InheritedSize[0x00B0])
	 */
	class UCharacterTravelingComponent : public UActorComponent
	{
	public:
		int32_t                                                    SpawnGroup;                                              // 0x00B0(0x0004) Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SpawnSafePeriod;                                         // 0x00B4(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		void OnRep_SpawnGroup();
		void MoveToSpawn();
		static UClass* StaticClass();
	};

	/**
	 * Class ProjectAgartha.CharacterWeaponsComponent
	 * Size -> 0x0000 (FullSize[0x00B0] - InheritedSize[0x00B0])
	 */
	class UCharacterWeaponsComponent : public UActorComponent
	{
	public:
		void OnWeaponUpdate();
		static UClass* StaticClass();
	};

	/**
	 * Class ProjectAgartha.ChatSubsystem
	 * Size -> 0x0030 (FullSize[0x0060] - InheritedSize[0x0030])
	 */
	class UChatSubsystem : public UGameInstanceSubsystem
	{
	public:
		unsigned char                                              UnknownData_VEQZ[0x8];                                   // 0x0030(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             OnMessageReceived;                                       // 0x0038(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_C65K[0x18];                                  // 0x0048(0x0018) MISSED OFFSET (PADDING)

	public:
		void SendMessage_3(EChatChannel _Channel, const class FString& _Name, const class FString& _Message);
		void SendMessage(const struct FChatLine& ChatLine);
		void ReceivedMessage(const struct FChatLine& ChatLine);
		void MuteChannel(EChatChannel Channel, bool bMuted);
		TArray<struct FChatLine> GetAllLinesFromChannel(EChatChannel Channel);
		class FString FormatLine(const struct FChatLine& ChatLine);
		static UClass* StaticClass();
	};

	/**
	 * Class ProjectAgartha.PlayerCharacter
	 * Size -> 0x0000 (FullSize[0x0530] - InheritedSize[0x0530])
	 */
	class APlayerCharacter : public ACharacterBase
	{
	public:
		void InitializeAbilityBindings();
		static UClass* StaticClass();
	};

	/**
	 * Class ProjectAgartha.CombatEntity
	 * Size -> 0x0308 (FullSize[0x0838] - InheritedSize[0x0530])
	 */
	class ACombatEntity : public APlayerCharacter
	{
	public:
		class FName                                                EntityName;                                              // 0x0530(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EBotStyle                                                  EntityStyle;                                             // 0x0538(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_IAW3[0x7];                                   // 0x0539(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UItem*                                               InsuranceItem;                                           // 0x0540(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UItem*                                               TempItem;                                                // 0x0548(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              BackendID;                                               // 0x0550(0x0010) BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsDoingAttack;                                          // 0x0560(0x0001) BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsChargingHeavyAttack;                                  // 0x0561(0x0001) BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsDoingHeavyAttack;                                     // 0x0562(0x0001) BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsDoingBlock;                                           // 0x0563(0x0001) BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bWantsToBlock;                                           // 0x0564(0x0001) BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bWantsToAim;                                             // 0x0565(0x0001) BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsAiming;                                               // 0x0566(0x0001) BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsReloading;                                            // 0x0567(0x0001) BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsRangedWeaponLoaded;                                   // 0x0568(0x0001) BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsDoingKick;                                            // 0x0569(0x0001) BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsLockedMovement;                                       // 0x056A(0x0001) BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsDoingDodge;                                           // 0x056B(0x0001) BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsDoingSprint;                                          // 0x056C(0x0001) BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bWantsToSprint;                                          // 0x056D(0x0001) BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsDoingCrouch;                                          // 0x056E(0x0001) BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bWantsToCrouch;                                          // 0x056F(0x0001) BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bBotWantsToCombo;                                        // 0x0570(0x0001) BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bBotWantsToHeavy;                                        // 0x0571(0x0001) BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsDoingFlinch;                                          // 0x0572(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WA78[0x1];                                   // 0x0573(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      DamageNormal;                                            // 0x0574(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DefaultFistStaminaPercentage;                            // 0x0578(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DefaultKickStaminaPercentage;                            // 0x057C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DamageCritical;                                          // 0x0580(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AttackSpeed;                                             // 0x0584(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DamageReduction;                                         // 0x0588(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MoveSpeed;                                               // 0x058C(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxHealth;                                               // 0x0590(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxStamina;                                              // 0x0594(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxFood;                                                 // 0x0598(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RegenHealth;                                             // 0x059C(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RegenStamina;                                            // 0x05A0(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RegenFood;                                               // 0x05A4(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinimumDamage;                                           // 0x05A8(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Health;                                                  // 0x05AC(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Stamina;                                                 // 0x05B0(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Food;                                                    // 0x05B4(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      GuardDirection;                                          // 0x05B8(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      FollowDistance;                                          // 0x05BC(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsAggressive;                                            // 0x05C0(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsUsingPrimary;                                         // 0x05C1(0x0001) BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsUsingShield;                                          // 0x05C2(0x0001) BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TH9G[0x5];                                   // 0x05C3(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              DisplayName;                                             // 0x05C8(0x0010) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    ReplicationPunchthrough;                                 // 0x05D8(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bSavesDisabledThisSession;                               // 0x05DC(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bPerformedInitialRaidSave;                               // 0x05DD(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6VBG[0x2];                                   // 0x05DE(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      DamageTakenTime;                                         // 0x05E0(0x0004) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RT6K[0x4];                                   // 0x05E4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UVoiceComponent*                                     MyVoiceComponent;                                        // 0x05E8(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UDataTable*                                          VoiceTablePointer;                                       // 0x05F0(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                VoiceIdentifier;                                         // 0x05F8(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USoundAttenuation*                                   VoiceAttenuation;                                        // 0x0600(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UArmorNoiseComponent*                                MyArmorNoiseComponent;                                   // 0x0608(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UDataTable*                                          ArmorNoiseTablePointer;                                  // 0x0610(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              ArmorWeightLevel;                                        // 0x0618(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_PCCW[0x7];                                   // 0x0619(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class USoundAttenuation*                                   ArmorNoiseAttenuation;                                   // 0x0620(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class UClass*>                                      HandAbilities;                                           // 0x0628(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic
		TArray<class UClass*>                                      SwordNoShieldAbilities;                                  // 0x0638(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic
		TArray<class UClass*>                                      SwordWithShieldAbilities;                                // 0x0648(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic
		TArray<class UClass*>                                      LongSwordAbilities;                                      // 0x0658(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic
		TArray<class UClass*>                                      CrossbowAbilities;                                       // 0x0668(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic
		TArray<class UClass*>                                      SecondaryAbilities;                                      // 0x0678(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic
		class UBinarySerializer*                                   BinaryDataIO;                                            // 0x0688(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YDD9[0x28];                                  // 0x0690(0x0028) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int64_t                                                    UniqueBehavior;                                          // 0x06B8(0x0008) Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EWeaponType                                                WeaponType;                                              // 0x06C0(0x0001) Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ZZ13[0x3];                                   // 0x06C1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      BaseHealth;                                              // 0x06C4(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      BaseStamina;                                             // 0x06C8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      BaseFood;                                                // 0x06CC(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      BaseHealthRegen;                                         // 0x06D0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      BaseStaminaRegen;                                        // 0x06D4(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      BaseFoodRegen;                                           // 0x06D8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      DamageReductionCap;                                      // 0x06DC(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      BaseStaminaAttack;                                       // 0x06E0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      BaseStaminaHeavy;                                        // 0x06E4(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      BaseStaminaBlock;                                        // 0x06E8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      BaseStaminaSprint;                                       // 0x06EC(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      BaseStaminaDodge;                                        // 0x06F0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      BaseStaminaKick;                                         // 0x06F4(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      BaseStaminaJump;                                         // 0x06F8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_HFIH[0x4];                                   // 0x06FC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FGameplayAbilitySpecHandle>                  WeaponTypeAbilityHandles;                                // 0x0700(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		ECharacterStance                                           Stance;                                                  // 0x0710(0x0001) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_Q4IE[0x3];                                   // 0x0711(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      StealthBonus;                                            // 0x0714(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCanSpawnBotBuddies;                                     // 0x0718(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsRagdoll;                                              // 0x0719(0x0001) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
